import React from 'react';
import s from "../../../pages/auth/auth.module.css";

const Modal = () => {
    return (
        <div>

            <button className="btn bg-gray-800 border-gray-800 ml-[450px] mt-7" onClick={() => { // @ts-ignore
                document.getElementById('my_modal_1').showModal()
            }}>Информация о приложение
            </button>

            <dialog id="my_modal_1" className="modal">
                <div className={s.infoApp}>
                    <h3 className="font-bold text-lg">Привет, дорогой друг!</h3>
                    <p className="py-4 ">
                        Привет, мы команда Разработчиков FigureTeam. <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                        ТестТестТестТестТестТестТестТестТестТестТестТестТестТестТест <br/>
                    </p>
                    <div className="modal-action">
                        <form method="dialog">
                            <button className="btn mr-[180px]">Закрыть окно</button>
                        </form>
                    </div>
                </div>
            </dialog>


        </div>
    );
};

export default Modal;